004/memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6158b72">No.152</a></li>
<li><a href="#org152f111">No.153</a></li>
<li><a href="#org0cd1fe3">No.154</a></li>
<li><a href="#org07c2177">No.156</a></li>
<li><a href="#orgb1aca88">No.157</a></li>
<li><a href="#orgaa8e20c">No.158</a></li>
<li><a href="#orgdfa5da1">No.159</a></li>
<li><a href="#orgcd0e657">No.160</a></li>
<li><a href="#org9082967">No.161</a></li>
<li><a href="#orgf8ad84b">No.163</a></li>
<li><a href="#orgd68db58">No.164</a></li>
<li><a href="#orgacabfd2">No.165</a></li>
<li><a href="#orge38a11a">No.166</a></li>
<li><a href="#orgb1e4859">No.167</a></li>
<li><a href="#org031d06e">No.168</a></li>
<li><a href="#org7404219">No.169</a></li>
<li><a href="#orgfc7dd96">No.170</a></li>
<li><a href="#org9d753db">No.171</a></li>
<li><a href="#orgded08d3">No.172</a></li>
<li><a href="#org2423b86">No.173</a></li>
<li><a href="#org2914fba">No.175</a></li>
<li><a href="#orgdc97a8f">No.176</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6158b72" class="outline-2">
<h2 id="org6158b72">No.152</h2>
<div class="outline-text-2" id="text-org6158b72">
<p>
\(a + b + c \leq \lfloor L/4 \rfloor\) となるピタゴラス数を数え上げる。
</p>

<p>
ピタゴラス数の数え上げは
</p>

<p>
\((a, b, c) = (m^2 - n^2, 2mn, m^2 + n^2)\) (ただし、\(m \gt n\), \(m\) と \(n\) は互いに素、\(m - n\) は奇数)
</p>

<p>
を使う。\(2m^2 \leq L/4\) であるから、\(m\) は最大でも \(10^3\) 強である。
</p>
</div>
</div>

<div id="outline-container-org152f111" class="outline-2">
<h2 id="org152f111">No.153</h2>
<div class="outline-text-2" id="text-org152f111">
<p>
grundy 数を計算する。
</p>

<p>
\(g(1) = 0\) であり、山が \(x_1, x_2\) 個の山に分裂したときの grundy 数は \(g(x_1) \oplus g(x_2)\) となる。
</p>
</div>
</div>

<div id="outline-container-org0cd1fe3" class="outline-2">
<h2 id="org0cd1fe3">No.154</h2>
<div class="outline-text-2" id="text-org0cd1fe3">
<p>
後ろの文字から見ていき、Rが通過した系統数 \(R\) 、Gが通過した系統数 \(G\) 、Wが通過した系統数 \(W\) をメモしておく。文字によってメモを以下のように更新する。
</p>

<ul class="org-ul">
<li>Rのときは \(R\) に \(1\) を加える。</li>
<li>Gのときは \(G \geq R\) ならば impossible。そうでなければ \(G\) に \(1\) を加える。</li>
<li>Wのときは \(G = 0\) ならば impossible。そうでなければ \(W\) に \(1\) を加える。ただし加えた結果 \(W \gt G\) となる場合は加えない。</li>
</ul>

<p>
最後まで見終わったときに \(R = G = W\) ならば possible、そうでなければ impossible である。
</p>
</div>
</div>

<div id="outline-container-org07c2177" class="outline-2">
<h2 id="org07c2177">No.156</h2>
<div class="outline-text-2" id="text-org07c2177">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-orgb1aca88" class="outline-2">
<h2 id="orgb1aca88">No.157</h2>
<div class="outline-text-2" id="text-orgb1aca88">
<p>
空洞をひとつ選び、そこから空洞を深さ(幅)優先探索で探索してかたまり1を確定させる。
</p>

<p>
残りの中から空洞をひとつ選び、そこから深さ(幅)優先探索でかたまり2を確定させていく。探索の途中で壁があった場合は、そこから幅優先探索でかたまり1にたどり着くまでの最短距離を求める。
</p>

<p>
すべての最短距離の最小値が答えである。
</p>
</div>
</div>

<div id="outline-container-orgaa8e20c" class="outline-2">
<h2 id="orgaa8e20c">No.158</h2>
<div class="outline-text-2" id="text-orgaa8e20c">
<p>
手持ちが \((A_{1000}, A_{100}, A_1)\) のときに行ける最大のお使い回数を返す関数を作り、メモ化再帰する。
</p>

<p>
\(D\) 円を払うための1000円、100円、1円の使い方は、大きい方のお金から使うようにすればいい。合計金額が足りているがちょうど払えない場合は大きい方のお金を持っているときだからである。
</p>
</div>
</div>

<div id="outline-container-orgdfa5da1" class="outline-2">
<h2 id="orgdfa5da1">No.159</h2>
<div class="outline-text-2" id="text-orgdfa5da1">
<p>
以下の計算式になる。
</p>

\begin{align*}
P_1 &= (1-p)q \\
P_2 &= p(1-q)q
\end{align*}

<p>
\(q \neq 0\) であるので、\(q\) で割っておいていい。
</p>
</div>
</div>

<div id="outline-container-orgcd0e657" class="outline-2">
<h2 id="orgcd0e657">No.160</h2>
<div class="outline-text-2" id="text-orgcd0e657">
<p>
ダイクストラ法で各駅からゴールまでの最小距離を求める。
</p>

<p>
その後、スタートから辞書順で小さい番号の駅でゴールまでの最小距離が一致する駅を順にたどる。
</p>
</div>
</div>

<div id="outline-container-org9082967" class="outline-2">
<h2 id="org9082967">No.161</h2>
<div class="outline-text-2" id="text-org9082967">
<p>
友人の手に勝てるカードをできるだけ出し、その後引き分けになるカードをできるだけ出す。
</p>
</div>
</div>

<div id="outline-container-orgf8ad84b" class="outline-2">
<h2 id="orgf8ad84b">No.163</h2>
<div class="outline-text-2" id="text-orgf8ad84b">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-orgd68db58" class="outline-2">
<h2 id="orgd68db58">No.164</h2>
<div class="outline-text-2" id="text-orgd68db58">
<p>
文字列を \(n\) 進数と解釈したときに最小にするには、\(n\) をできるだけ小さくするように取ればいい。
</p>
</div>
</div>

<div id="outline-container-orgacabfd2" class="outline-2">
<h2 id="orgacabfd2">No.165</h2>
<div class="outline-text-2" id="text-orgacabfd2">
<p>
座標圧縮をしておく。
</p>

<p>
X軸方向の範囲は全探索し、Y軸方向の範囲はしゃくとり法で探索する。
</p>
</div>
</div>

<div id="outline-container-orge38a11a" class="outline-2">
<h2 id="orge38a11a">No.166</h2>
<div class="outline-text-2" id="text-orge38a11a">
<p>
番号は \(0\) から振られるものとして \(K\) を調整しておく。
</p>

<p>
\(HW - 1\) を \(N\) で割った余りが \(K\) ならば \(K\) 番目の人は負けである。
</p>
</div>
</div>

<div id="outline-container-orgb1e4859" class="outline-2">
<h2 id="orgb1e4859">No.167</h2>
<div class="outline-text-2" id="text-orgb1e4859">
<p>
下一桁の数字と累乗数の関係は以下の通りである。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-right">3</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-right">5</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">8</td>
<td class="org-right">6</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">9</td>
<td class="org-right">7</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">9</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">8</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">1</td>
<td class="org-right">9</td>
<td class="org-right">1</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
すべて周期4で循環しているので、\(N\) の下一桁と \(M\) を \(4\) で割った余りだけ見ればいい。
なお、\(M\) を \(4\) で割った余りを計算するためには \(M\) の下二桁だけ見ればいい。
</p>

<p>
コーナーケースとして、\(M = 0\) のときは \(N^M = 1\) である。
</p>
</div>
</div>

<div id="outline-container-org031d06e" class="outline-2">
<h2 id="org031d06e">No.168</h2>
<div class="outline-text-2" id="text-org031d06e">
<p>
二点間の距離を求め、ソートする。
</p>

<p>
Union-Find で短い距離順に辺を追加していき、\(P_1\) と \(P_N\) が同じグループに属するようになったときの長さからものさしの長さを求める。
</p>

<p>
誤差を回避するために距離は2乗で計算しておき、最後に平方根を取るようにする。平方根は二分探索を使って誤差の影響を受けないようにする。
</p>
</div>
</div>

<div id="outline-container-org7404219" class="outline-2">
<h2 id="org7404219">No.169</h2>
<div class="outline-text-2" id="text-org7404219">
<p>
処理時間を \(T\) とすると、
</p>

<p>
\[ \frac{T - S}{T} = \frac{K}{100} \]
</p>

<p>
となり、これを解いて、
</p>

<p>
\[ T = \frac{100S}{100-K} \]
</p>

<p>
となる。
</p>
</div>
</div>

<div id="outline-container-orgfc7dd96" class="outline-2">
<h2 id="orgfc7dd96">No.170</h2>
<div class="outline-text-2" id="text-orgfc7dd96">
<p>
文字の出現頻度を数え上げる。文字列 \(i\) の出現頻度を \(C_i\) とすると、組み合わせの数は
</p>

<p>
\[ \frac{|S|!}{\prod C_i!} \]
</p>

<p>
となる。
</p>
</div>
</div>

<div id="outline-container-org9d753db" class="outline-2">
<h2 id="org9d753db">No.171</h2>
<div class="outline-text-2" id="text-org9d753db">
<p>
文字列 \(s\) があるとき、ここに \(s\) に含まれない文字 \(c\) を \(n\) 個追加したときの組み合わせの数を考える。これは、挿入箇所が \(|s| + 1\) 個ありそこに \(n\) 個の文字を振り分ける組み合わせの数である。
</p>

<p>
\(i\) 個の箱に \(j\) 個の玉を振り分ける組み合わせの数を \(C(i, j)\) とすると、
</p>

<p>
\[ C(i, j) = C(i - 1, j) + C(i - 1, j - 1) + C(i - 1, j - 2)\cdots \]
</p>

<p>
となる。ただし、\(C(1, *) = 1\) である。ここで、
</p>

<p>
\[ C(i - 1, j - 1) + C(i - 1, j - 2) + \cdots = C(i, j - 1) \]
</p>

<p>
であるので、
</p>

<p>
\[ C(i, j) = C(i - 1, j) + C(j, i - 1) \]
</p>

<p>
となる。これを DP で計算する。
</p>

<p>
あとはすべてのアルファベットで順に計算すればいい。
</p>
</div>
</div>

<div id="outline-container-orgded08d3" class="outline-2">
<h2 id="orgded08d3">No.172</h2>
<div class="outline-text-2" id="text-orgded08d3">
<p>
第一象限のみ考える。
</p>

<p>
UFO が結界に接するとき、接点は \((x + r/\sqrt{2}, y + r/\sqrt{2})\) となる。結界をこれより大きくすればいい。
</p>
</div>
</div>

<div id="outline-container-org2423b86" class="outline-2">
<h2 id="org2423b86">No.173</h2>
<div class="outline-text-2" id="text-org2423b86">
<p>
モンテカルロ法で実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-org2914fba" class="outline-2">
<h2 id="org2914fba">No.175</h2>
<div class="outline-text-2" id="text-org2914fba">
<p>
コドンの種類数は \(2^3 = 8\) である。
</p>

<p>
塩基配列のコドンの数を \(l = L/3\) とすると、すべての組み合わせの数は、\(8^{l-1} \cdot N\) となる。
</p>

<p>
\(8^{10} \sim 10^9\) であるから、int の範囲で収まる。
</p>
</div>
</div>

<div id="outline-container-orgdc97a8f" class="outline-2">
<h2 id="orgdc97a8f">No.176</h2>
<div class="outline-text-2" id="text-orgdc97a8f">
<p>
\[ Ax + By = k \ (x, y \leq 0, k \leq T) \]
</p>

<p>
を求める問題である。
</p>

<p>
\(y\) を \(0\) から順に探索する。探索範囲は、\(0 \leq y \leq \min(\lcm(A, B), \lceil T/B \rceil)\) である。これは、\(y = \lcm(A, B) + k\) のときは \(y\) を \(k\) 枚にしてその分を \(A\) に振り分けたときと合計金額が変わらないからである。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
